<%@ page language="java" contentType="text/html; charset=euc-kr" %>
<script language="javascript" src="${CPATH}/js/lib.validate.js"></script>
<script language="javascript">
	function frmSubmit(frm) {
			if(!frm.agree.checked) {
				alert("회원가입 약관에 동의 하셔야 합니다");
			} else {
				if(validate(frm)) {
					return true;
				}
			}
			return false;
	}
</script>

<table width="95%" border="0" cellspacing="0" cellpadding="0" align="center"  >
		<tr>
			<td style="padding-left: 20px; padding-right: 20px; padding-top: 20px; padding-bottom: 20px;">
			<form action="${control_action}" method="post" name="myform" id="myform" onSubmit="return frmSubmit(this)">
			<input type="hidden" name="cmd" value="step02">
			
			<table align="center">
			<tr>
				<td>가입을 원하시면 아래의 <strong>'서비스약관 및 개인정보보호정책'</strong>을 반드시 읽고 '동의'버튼을 선택해 주세요</td>
			</tr>
			<tr>
				<td width="560">회원약관<br>
				
                <textarea style="border-style:groove;" name=# rows=20 cols=90>제1조(목적)
이 약관은 한국 썬 마이크로시스템즈(주) 교육사업부(이하 "회사")가 운영하는 홈페이지(이하 "홈페이지"라 한다)에서 제공하는 인터넷 서비스(이하 "서비스"라 한다)를 이용함에 있어 홈페이지와 그 이용자의 권리·의무 및 책임 사항을 규정함을 목적으로 합니다.

제2조(정의)
① "홈페이지" 란 회사가 교육 정보 및 기술 등을 이용자에게 제공하고, 재화 구매 계약을 체결하는 공간입니다. 
② "이용자"란 "홈페이지"에 접속하여 이 약관에 따라 "홈페이지"가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
③ '회원'이라 함은 "홈페이지"에 개인정보를 제공하여 회원등록을 한 자로서, "홈페이지"의 정보를 지속적으로 제공받으며, "홈페이지"가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
④ '비회원'이라 함은 회원에 가입하지 않고 "홈페이지"가 제공하는 서비스를 이용하는 자를 말합니다.

제3조 (약관의 명시와 개정)
① "홈페이지"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처(전화, 팩스, 전자우편 주소 등) 등을 이용자가 알 수 있도록 홈페이지의 초기 서비스화면(전면)에 게시합니다.
② "홈페이지"는 약관의규제에관한법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진등에관한법률, 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
③ "홈페이지"의 약관은 회사가 "홈페이지" 등을 통해 회원들에게 공지함으로써 그 효력이 발생합니다.
④ 변경된 약관의 효력은 약관 변경 전에 가입한 회원 전체에게 소급 적용됩니다. 

제4조(서비스의 제공 및 변경)
① "홈페이지"는 다음과 같은 업무를 수행합니다.
   1. 교육 및 기술에 대한 정보 제공 및 구매계약의 체결
   2. 기타 "홈페이지"가 정하는 업무
② "홈페이지"가 제공하기로 이용자와 계약을 체결한 서비스의 내용을 변경할 경우에는 "홈페이지"는 이로 인하여 이용자가 입은 손해를 배상합니다. 단, "홈페이지"에 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.

제5조(서비스의 중단)
① "홈페이지"는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
② 제1항에 의한 서비스 중단의 경우에는 "홈페이지"는 제8조에 정한 방법으로 이용자에게 통지합니다.
③ "홈페이지"는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다. 단 "홈페이지"에 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.

제6조(회원가입)
① 이용자는 "홈페이지"가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.
② "홈페이지"는 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각호에 해당하지 않는 한 회원으로 등록합니다.
   1. 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원자격 상실후 3년이 경과한 자로서 "몰"의 회원재가입 승낙을 얻은 경우에는 예외로 한다.
   2. 등록 내용에 허위, 기재누락, 오기가 있는 경우
   3. 기타 회원으로 등록하는 것이 "홈페이지"의 기술상 현저히 지장이 있다고 판단되는 경우
③ 회원가입계약의 성립시기는 "홈페이지"의 승낙이 회원에게 도달한 시점으로 합니다.
④ 회원은 제15조제1항에 의한 등록사항에 변경이 있는 경우, 즉시 전자우편 기타 방법으로 "홈페이지"에 대하여 그 변경사항을 알려야 합니다.

제7조(회원 탈퇴 및 자격 상실 등)
① 회원은 "홈페이지"에 언제든지 탈퇴를 요청할 수 있으며 "홈페이지"는 즉시 회원탈퇴를 처리합니다.
② 회원이 다음 각호의 사유에 해당하는 경우, "홈페이지"는 회원자격을 제한 및 정지시킬 수 있습니다.
   1. 가입 신청시에 허위 내용을 등록한 경우
   2. "홈페이지"를 이용하여 구입한 재화·용역 등의 대금, 기타 "홈페이지" 이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우
   3. 다른 사람의 "홈페이지" 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
   4. "홈페이지"를 이용하여 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
③ "홈페이지"가 회원 자격을 제한·정지 시킨후, 동일한 행위가 2회이상 반복되거나 30일이내에 그 사유가 시정되지 아니하는 경우 "홈페이지"는 회원자격을 상실시킬 수 있습니다.
④ "홈페이지"가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소전에 소명할 기회를 부여합니다.

제8조(회원에 대한 통지)
① "홈페이지"가 회원에 대한 통지를 하는 경우, 회원이 "홈페이지"에 제출한 전자우편 주소로 할 수 있습니다.
② "홈페이지"는 불특정다수 회원에 대한 통지의 경우 1주일이상 "홈페이지" 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다.

제9조(개인정보보호)
① "홈페이지"는 이용자의 정보수집시 구매계약 이행에 필요한 최소한의 정보를 수집합니다. 다음 사항을 필수사항으로 하며 그 외 사항은 선택사항으로 합니다.
   1. 이용자 ID
   2. 암호
   3. 이름 
   4. 주민등록번호(회원의 경우) 
   5. E-MAIL 
   6. E-MAIL 수신여부 
   7. 전화번호
② "홈페이지"가 이용자의 개인식별이 가능한 개인정보를 수집하는 때에는 반드시 당해 이용자의 동의를 받습니다.
③ 제공된 개인정보는 당해 이용자의 동의없이 목적외의 이용이나 제3자에게 제공할 수 없습니다.
④ 이용자는 언제든지 "홈페이지"가 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 "홈페이지"는 이에 대해 지체없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 "홈페이지"는 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다. 
⑤ "홈페이지" 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체없이 파기합니다.

제10조("홈페이지"의 의무)
① "홈페이지"는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하는 데 최선을 다하여야 합니다.
② "홈페이지"는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
③ "홈페이지"는 이용자가 원하지 않는 영리목적의 광고성 전자우편을 이용자의 동의 없이 발송하지 않습니다.

제11조( 회원의 비밀번호에 대한 의무)
① 제9조의 경우를 제외한 비밀번호에 관한 관리책임은 회원에게 있습니다.
② 회원은 자신의 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
③ 회원이 자신의 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 "홈페이지"에 통보하고 "홈페이지"의 안내가 있는 경우에는 그에 따라야 합니다.

제12조(이용자의 의무)
이용자는 다음 행위를 하여서는 안됩니다.
   1. 신청 또는 변경시 허위내용의 등록
   2. "홈페이지"에 게시된 정보의 변경
   3. "홈페이지"가 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시
   4. "홈페이지" 기타 제3자의 저작권 등 지적재산권에 대한 침해
   5. "홈페이지" 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
   6. 외설 또는 폭력적인 메시지·화상·음성 기타 공서양속에 반하는 정보를 홈페이지"에 공개 또는 게시하는 행위

제13조(저작권의 귀속 및 이용제한)
① "홈페이지"가 작성한 저작물에 대한 저작권 기타 지적재산권은 "홈페이지"에 귀속합니다.
② 이용자는 "홈페이지"를 이용함으로써 얻은 정보를 "홈페이지"의 사전 승낙없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
③ "Sun Trademarks"의 의미는 회사의 제품이나 서비스와 연결되는 모든 이름과 기호, 브랜드, 로고, 디자인 등이며, 무단으로 이용자가 사용할 수 없습니다. 

제21조(분쟁해결)
① "홈페이지"는 이용자가 제기하는 정당한 의견이나 불만을 반영합니다.
② "홈페이지"는 이용자로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.
③ "홈페이지"와 이용자간에 발생한 분쟁은 전자거래기본법 제28조 및 동 시행령 제15조에 의하여 설치된 전자거래분쟁조정위원회의 조정에 따를 수 있습니다.

제22조(재판권 및 준거법)
① "홈페이지"와 이용자간에 발생한 전자거래 분쟁에 관한 소송은 민사소송법상의 관할법원에 제기합니다.
② "홈페이지"와 이용자간에 제기된 전자거래 소송에는 한국법을 적용합니다.

                                                					    
</textarea>
				
				
				
				</td>
			</tr>
		
			
			<tr>
				<td height="5"></td>
			</tr>
			<tr>
				<td align="center"><hr size="1" color="cccccc">
					<table cellspacing="0" cellpadding="0" >
						<tr>
							<td width="90"><img src="${CPATH}/images/www/member/lbl_aggrement.gif" alt=""  border="0"></td>
							<td width="5"></td>
							<td width="600"><table width="100%" border="0">
									<tr>
										<th align="right">이&nbsp;&nbsp;름 : </th>
										<td><input type="text" name="nm" size="20" maxlength="15" required hname="이름"></td>
									</tr>
									<tr>
										<th align="right">주민등록번호 : </th>
										<td><input type="text" name="pin_1" span="2" glue="-"  size="6" maxlength="6"  required hname="주민등록번호" option="jumin">-
											<input type="text" name="pin_2" size="7" maxlength="7"  required hname="주민등록번호" ></td>
									</tr>
									<tr>
										<td align="center" colspan="2"><input type="checkbox" name="agree" value="agree" style="background-color: transparent; border: none;"> 위의 '<strong>약관 및 정책</strong>'에 동의합니다.</td>
									</tr>
								</table></td>
							</tr>
						</table><hr size="1" color="cccccc">
				</td>
			</tr>
			<tr>
				<td height="5"></td>
			</tr>
			<tr>
				<td align="center"><input type="image" src="${CPATH}/images/www/member/btn_agreement01.gif" align="absmiddle" border="0">&nbsp;
				<a href="${CPATH}"><img src="${CPATH}/images/www/member/btn_agreement02.gif" alt="" border="0" align="middle"></a></td>
			</tr>
			</table>
			</form></td>
		</tr>
		</table>
